Documents/ДоговорОтветственногоСодержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДоговорОтветственногоСодержания</Name>
			<BasedOn>
				<xr:Item>Document.Собеседование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыМестаСодержанияЖивотных</xr:Item>
				<xr:Item>AccumulationRegister.ЗаполненностьКомнат</xr:Item>
				<xr:Item>InformationRegister.ОпекуныУкотовителиПодопечных</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Укотовитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОпекуныУкотовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собеседование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Собеседование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыМестаСодержанияЖивотных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыМестаСодержанияЖивотных</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПребыванияЖивотных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоСодержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Комнаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПеремещенияЖивотных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаполненностьКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаполненностьКомнат</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоКотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комнаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОпекуныУкотовителиПодопечных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОпекуныУкотовителиПодопечных</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОпекунУкотовитель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОпекунУкотовитель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПребыванияЖивотных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПребыванияЖивотных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКарантине</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЛеченииПриют</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЛеченииВетклиника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКУкотовлению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Укотовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПередержке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мертв</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОпекунУкотовитель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОпекунУкотовитель</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Опекун</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Укотовитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДоговорОтветственногоСодержания/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания КАК МестоСодержания
		|ИЗ
		|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПоследних(&Период, Кошка = &Кошка) КАК СтатусыМестаСодержанияЖивотныхСрезПоследних";
	
	Запрос.УстановитьПараметр("Кошка", Кошка);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ТекстОшибки = СтрШаблон("Не удалось определить место содержания %1!", Кошка.Наименование);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Комната = Выборка.МестоСодержания;
	КонецЕсли;
	
	// регистр СтатусыМестаСодержанияЖивотных
	Движения.СтатусыМестаСодержанияЖивотных.Записывать = Истина;
	Движение = Движения.СтатусыМестаСодержанияЖивотных.Добавить();
	Движение.Период             = Дата;
	Движение.Кошка              = Кошка;
	Движение.Статус             = Перечисления.СтатусыПребыванияЖивотных.Укотовлен;
	Движение.ПричинаПеремещения = Справочники.ПричиныПеремещенияЖивотных.Укотовление;

	// регистр ЗаполненностьКомнат Расход
	Движения.ЗаполненностьКомнат.Записывать = Истина;
	Движение = Движения.ЗаполненностьКомнат.Добавить();
	Движение.ВидДвижения     = ВидДвиженияНакопления.Расход;
	Движение.Период          = Дата;
	Движение.Комната         = Комната;
	Движение.КоличествоКотов = 1;
	
	// регистр ОпекуныУкотовителиПодопечных
	Движения.ОпекуныУкотовителиПодопечных.Записывать = Истина;
	Движение = Движения.ОпекуныУкотовителиПодопечных.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.ОпекунУкотовитель = Перечисления.ОпекунУкотовитель.Укотовитель;
	ФизическоеЛицоУкотовителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Укотовитель, "ФизическоеЛицо");
	Если ЗначениеЗаполнено(ФизическоеЛицоУкотовителя) Тогда
		Движение.ФизическоеЛицо = ФизическоеЛицоУкотовителя;
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Собеседование") Тогда
		Если НЕ ДанныеЗаполнения.Пройдено Тогда
			ВызватьИсключение "Собеседование не пройдено! Создание договора возможно только в случае успешного прохождения.";
		КонецЕсли;
		Кошка         = ДанныеЗаполнения.Кошка;
		Собеседование = ДанныеЗаполнения.Ссылка;
		Укотовитель   = ДанныеЗаполнения.Укотовитель;
	КонецЕсли;

КонецПроцедуры
